[
  {
    "slug": "mujoco",
    "title": "Dynamic Pole Balancing with Nonlinear MPC",
    "timeframe": "Feb 2026 – Present",
    "location": "London, UK",
    "tags": ["Robotics", "Control", "Simulation"],
    "oneLiner": "An underactuated dynamic control system using a CasADi-based Nonlinear Model Predictive Controller to balance a free-swinging pole on a 7-DOF Franka Emika Panda robot.",
    "problem": "Balancing an unactuated pole on a high-DOF manipulator requires real-time optimal control that can handle nonlinear dynamics, underactuation, and the tight coupling between end-effector motion and pole stability.",
    "built": [
      "Engineered a high-fidelity MuJoCo physics simulation featuring a Franka Panda manipulator with a free-hinged, unactuated pole attached to its end-effector.",
      "Formulated the system's equations of motion using a Linear Inverted Pendulum (LIP) approximation to allow for real-time optimal control calculations.",
      "Developed a receding-horizon Nonlinear Model Predictive Control (NMPC) solver from scratch using CasADi to compute optimal end-effector accelerations.",
      "Implemented an Operational Space Controller (Inverse Dynamics) to map the MPC's Cartesian acceleration commands into precise joint torques across the 7-DOF arm at a 500Hz control rate."
    ],
    "stack": ["Python", "C++", "MuJoCo", "CasADi", "IPOPT", "NumPy", "SciPy"],
    "results": [
      "Base physics simulation and unactuated joint modeling complete.",
      "Actively tuning MPC cost function weights to balance control effort against pole angle deviation.",
      "Next: Domain Randomization (varying pole mass and friction) to prove controller robustness for Sim-to-Real transfer."
    ],
    "links": { "github": "", "demo": "", "paper": "" }
  },
  {
    "slug": "vla",
    "title": "VLA-Agent: Language-Conditioned Robotic Manipulation",
    "timeframe": "Oct 2025 – Present",
    "location": "London, UK",
    "tags": ["Embodied AI", "LLM", "Robotics"],
    "oneLiner": "An embodied AI system that translates natural language instructions into multi-step physical robotic actions using Large Language Models and constraint-based manipulation.",
    "problem": "Bridging natural language understanding and physical manipulation requires reliable grounding of abstract instructions into precise, verifiable robotic actions—with error recovery when the physical world doesn't cooperate.",
    "built": [
      "Engineered a closed-loop tabletop physics simulation in PyBullet, featuring a 7-DOF Franka Emika Panda arm interacting with dynamically spawned objects.",
      "Developed a robust Skills Layer of manipulation primitives (pick, place, push) handling Inverse Kinematics, joint-space motion, and constraint-based grasping.",
      "Designed an orchestration agent bridging physical environments with LLMs (GPT-4 / Claude), building contextual scene prompts and parsing structured JSON action plans.",
      "Implemented a feedback loop where the system verifies physical success of actions and re-prompts the LLM for error correction.",
      "Built a production-grade codebase with an interactive CLI REPL and 176 headless tests validating everything from low-level physics to prompt construction."
    ],
    "stack": ["Python", "PyBullet", "OpenAI API", "Anthropic API", "NumPy", "SciPy", "Pytest"],
    "results": [
      "Version 1.0 fully deployed: agent successfully executes complex multi-turn spatial reasoning tasks with reliable pick-and-place and robust error recovery.",
      "Next: Transitioning to an in-house Agentic Training Pipeline—building a headless synthetic data generator to fine-tune a local SLM via LoRA, followed by DPO alignment."
    ],
    "links": { "github": "", "demo": "", "paper": "" }
  },
  {
    "slug": "human3d",
    "title": "Human3D — Single-Shot 3D Gaussian Splatting Engine",
    "timeframe": "2025 – Present",
    "location": "London, UK",
    "tags": ["Vision", "Graphics", "Generative 3D"],
    "oneLiner": "An end-to-end 3D reconstruction pipeline that converts a single 2D RGB image into a view-consistent 3D representation using differentiable Gaussian rasterization.",
    "problem": "Deterministic 2.5D point-cloud projection produces hollow, view-inconsistent reconstructions. A generative approach using 3D Gaussian Splatting with smart initialization solves the cold-start problem and produces dense, renderable 3D assets.",
    "built": [
      "Upgraded a legacy deterministic 2.5D point-cloud projection system into a fully generative 3D Gaussian Splatting pipeline.",
      "Leveraged the original perception stack (YOLOv8, SAM, MiDaS depth) to create clean RGB-D priors, solving the cold-start initialization problem for the Gaussians.",
      "Engineered a PyTorch training loop from scratch featuring adaptive densification (cloning and splitting Gaussians) to resolve fine geometric details.",
      "Integrated a differentiable GPU rasterization backend using the gsplat library, utilizing Mixed Precision (AMP) to significantly accelerate training."
    ],
    "stack": ["PyTorch 2.x", "CUDA", "gsplat", "MiDaS", "SAM", "YOLOv8", "Mixed Precision (AMP)"],
    "results": [
      "Optimized 10K+ Gaussians in under 20 seconds on consumer hardware (RTX 3050), achieving ~26dB PSNR.",
      "Real-time rendering at ~200 FPS (5 ms).",
      "Pipeline exports binary PLY assets compatible with standard browser-based 3D splat viewers."
    ],
    "links": { "github": "", "demo": "", "paper": "" }
  },
  {
    "slug": "noninvasive-biomarker-ml",
    "title": "Undergrad Thesis — Non-Invasive Biomarker ML System",
    "timeframe": "Aug 2024 – May 2025",
    "location": "Visakhapatnam, India",
    "tags": ["ML", "Simulation", "Signal Processing"],
    "oneLiner": "Monte Carlo photon-transport simulation + regression models for haemoglobin and glucose estimation.",
    "problem": "Non-invasive physiological estimation suffers from noisy signals and limited labeled data. This project uses physics-based simulation plus ML to predict biomarkers from spectral signals.",
    "built": [
      "Generated synthetic optical dataset via Monte Carlo photon-transport simulations.",
      "Built regression models (RF, MLP, SVR) for haemoglobin and glucose prediction.",
      "Designed signal-processing + feature extraction for noisy spectral data; validated on a small experimental dataset."
    ],
    "stack": ["Python", "Monte Carlo simulation", "RF", "MLP", "SVR"],
    "results": [
      "End-to-end pipeline from simulated spectra to biomarker estimates.",
      "Documented validation behavior and robustness limits."
    ],
    "links": { "github": "", "demo": "", "paper": "" }
  },
  {
    "slug": "adaptive-prosthesis-control",
    "title": "Smart India Hackathon — Adaptive Prosthesis Control System",
    "timeframe": "Oct 2023 – May 2024",
    "location": "Visakhapatnam, India",
    "tags": ["Robotics", "BCI", "Control"],
    "oneLiner": "EEG-driven control pipeline with stabilised real-time servo execution for multi-gesture movements.",
    "problem": "BCI signals are noisy and unstable, but prosthetic control needs reliable commands. This system focuses on robust preprocessing and stabilised actuation.",
    "built": [
      "Designed EEG preprocessing, artifact removal, and gesture classification pipeline.",
      "Implemented real-time servo control for multi-gesture arm movements.",
      "Built a stabilisation layer for noise-suppressed command execution."
    ],
    "stack": ["Python", "Signal Processing", "EEG", "Embedded control"],
    "results": [
      "Winner: Smart India Hackathon (Hardware Edition).",
      "Demonstrated reliable gesture-to-actuation mapping under noise."
    ],
    "links": { "github": "", "demo": "", "paper": "" }
  }
]
